<?php
/**
 * Created by PhpStorm.
 * User: Administrator
 * Date: 2016-12-13
 * Time: 19:30
 */

/*
 * 常量
 * 常量是一个简单值的标识符（名字）。如同其名称所暗示的，在脚本执行期间该值不能改变（除了所谓的魔术常量，它们其实不是常量）。
 * 常量默认为大小写敏感。传统上常量标识符总是大写的。
 * 常量名和其它任何 PHP 标签遵循同样的命名规则。合法的常量名以字母或下划线开始，后面跟着任何字母，数字或下划线。
 * 用正则表达式是这样表达的：[a-zA-Z_\x7f-\xff][a-zA-Z0-9_\x7f-\xff]*。
 * 在这里，字母指的是 a-z，A-Z，以及从 127 到 255（0x7f-0xff）的 ASCII 字符。
 * 合法与非法的常量名
 */
// 合法的常量名
define("FOO", "something");
define("FOO2", "something else");
define("FOO_BAR", "something more");

// 非法的常量名
define("2FOO", "something");

// 下面的定义是合法的，但应该避免这样做：(自定义常量不要以__开头)
// 也许将来有一天PHP会定义一个__FOO__的魔术常量
// 这样就会与你的代码相冲突
define("__FOO__", "something");
/*
 * 和 superglobals 一样，常量的范围是全局的。不用管作用区域就可以在脚本的任何地方访问常量。有关作用区域的更多信息请阅读手册中的变量范围。
 *
 * 语法
 * 可以用 define() 函数来定义常量，在 PHP 5.3.0 以后，可以使用 const 关键字在类定义之外定义常量。
 * 一个常量一旦被定义，就不能再改变或者取消定义。 常量只能包含标量数据（boolean，integer，float 和 string）。
 * 可以定义 resource 常量，但应尽量避免，因为会造成不可预料的结果。
 * 可以简单的通过指定其名字来取得常量的值，与变量不同，不应该在常量前面加上 $ 符号。
 * 如果常量名是动态的，也可以用函数 constant() 来获取常量的值。
 * 用 get_defined_constants() 可以获得所有已定义的常量列表。
 *
 * 常量和（全局）变量在不同的名字空间中。这意味着例如 TRUE 和 $TRUE 是不同的。
 *
 * 如果使用了一个未定义的常量，PHP 假定想要的是该常量本身的名字，如同用字符串调用它一样（CONSTANT 对应 "CONSTANT"）。
 * 此时将发出一个 E_NOTICE 级的错误。参见手册中为什么 $foo[bar] 是错误的（除非事先用 define() 将 bar 定义为一个常量）。
 * 如果只想检查是否定义了某常量，用 defined() 函数。
 *
 * 常量和变量有如下不同：
 * 常量前面没有美元符号（$）；
 * 常量只能用 define() 函数定义，而不能通过赋值语句；
 * 常量可以不用理会变量的作用域而在任何地方定义和访问；
 * 常量一旦定义就不能被重新定义或者取消定义；
 * 常量的值只能是标量。
 */
//定义常量
define("CONSTANT", "Hello world.");
echo CONSTANT; // outputs "Hello world."
echo Constant; // 输出 "Constant" 并发出一个提示级别错误信息
//使用关键字 const 定义常量
// 以下代码在 PHP 5.3.0 后可以正常工作
const CONSTANT = 'Hello World';
echo CONSTANT;
/*
 * 和使用 define() 来定义常量相反的是，使用 const 关键字定义常量必须处于最顶端的作用区域，因为用此方法是在编译时定义的。
 * 这就意味着不能在函数内，循环内以及 if 语句之内用 const 来定义常量。
 */

/*
 * 魔术常量
 * PHP 向它运行的任何脚本提供了大量的预定义常量。
 * 不过很多常量都是由不同的扩展库定义的，只有在加载了这些扩展库时才会出现，或者动态加载后，或者在编译时已经包括进去了。
 * 有八个魔术常量它们的值随着它们在代码中的位置改变而改变。例如 __LINE__ 的值就依赖于它在脚本中所处的行来决定。
 * 这些特殊的常量不区分大小写，如下
 * __LINE__  文件中的当前行号。
 * __FILE__  文件的完整路径和文件名。如果用在被包含文件中，则返回被包含的文件名。
 * 自 PHP 4.0.2 起，__FILE__ 总是包含一个绝对路径（如果是符号连接，则是解析后的绝对路径），而在此之前的版本有时会包含一个相对路径。
 * __DIR__  文件所在的目录。如果用在被包括文件中，则返回被包括的文件所在的目录。
 * 它等价于 dirname(__FILE__)。除非是根目录，否则目录中名不包括末尾的斜杠。（PHP 5.3.0中新增） =
 * __FUNCTION__  函数名称（PHP 4.3.0 新加）。自 PHP 5 起本常量返回该函数被定义时的名字（区分大小写）。在 PHP 4 中该值总是小写字母的。
 * __CLASS__  类的名称（PHP 4.3.0 新加）。自 PHP 5 起本常量返回该类被定义时的名字（区分大小写）。在 PHP 4 中该值总是小写字母的。
 * 类名包括其被声明的作用区域（例如 Foo\Bar）。注意自 PHP 5.4 起 __CLASS__ 对 trait 也起作用。
 * 当用在 trait 方法中时，__CLASS__ 是调用 trait 方法的类的名字。
 * __TRAIT__  Trait 的名字（PHP 5.4.0 新加）。自 PHP 5.4 起此常量返回 trait 被定义时的名字（区分大小写）。
 * Trait 名包括其被声明的作用区域（例如 Foo\Bar）。
 * __METHOD__  类的方法名（PHP 5.0.0 新加）。返回该方法被定义时的名字（区分大小写）。
 * __NAMESPACE__  当前命名空间的名称（区分大小写）。此常量是在编译时定义的（PHP 5.3.0 新增）。
 *
 * 参见 get_class()，get_object_vars()，file_exists() 和 function_exists()。
 */